In [ ]:
import pandas as pd

### 2.1 Lectura y analisis exploratorio de datos

Cargar base de datos

In [ ]:
df = pd.read_csv('ejemplo_data.csv')

In [ ]:
df

Tipo de varibles disponibles en la base de datos

In [ ]:
df.dtypes

Transformación de atributo "ID" a entero y atributo "Activo" a booleano

In [ ]:
df['ID']= df['ID'].astype('int')

In [ ]:
df.dtypes

In [ ]:
df['Activo'] = df['Activo'].astype('bool')

In [ ]:
df.dtypes

Atributo "unidades" a entero y "2016" a flotante

In [33]:
df['Unidades'] = pd.to_numeric(df['Unidades'], errors= 'coerce')

In [34]:
df['Unidades'] = df['Unidades'].dropna().astype(int)

In [35]:
df.dtypes

ID               int32
Nombre          object
2016           float64
2017            object
Crecimiento     object
Unidades         int32
fecha           object
Activo            bool
dtype: object

In [24]:
def convertir(val):
    nuevo_tipo = val.replace(',','').replace('$', '').replace('%','')
    return float(nuevo_tipo)

In [25]:
df['2016'] = df['2016'].apply(convertir)

In [36]:
df.dtypes

ID               int32
Nombre          object
2016           float64
2017            object
Crecimiento     object
Unidades         int32
fecha           object
Activo            bool
dtype: object

### 2.2 Lectura y analisis exploratorio de datos 2

In [ ]:
import pandas as pd

Cargar la base de datos

In [ ]:
df = pd.read_csv('ecommerce_data.csv', encoding='latin1')

Tipos de varibles que hay disponibles en la base de datos

In [ ]:
df.dtypes

Utilizando la funcion astype transforme el atributo "InvoiceNo" a entero y el atributo "Description" a string

In [ ]:
df['InvoiceNo'] = pd.to_numeric(df['InvoiceNo'], errors= 'coerce')

In [ ]:
df.dtypes

In [ ]:
df ['Description'] = df ['Description'].astype(str)

In [ ]:
df.dtypes

Atributo "Quantity" a entero y "UnitPrice" a flotante

In [ ]:
df['Quantity']= df['Quantity'].astype('int')

In [ ]:
df.dtypes

In [ ]:
df['UnitPrice']= df['UnitPrice'].astype('float')

In [ ]:
df.dtypes

La columna "InvoiceDate" contiene un string que representa "fecha-hora", separe la columna en dos columnas que representen cada atributo por separado

In [ ]:
df['Fecha'] = pd.to_datetime(df['InvoiceDate']).dt.date 
df['Hora'] = pd.to_datetime(df['InvoiceDate']).dt.time

In [ ]:
df

Nueva columna que represente el monto total para cada boleta

In [ ]:
df['MontoTotal'] = df['UnitPrice']*df['Quantity']

In [ ]:
df

Exporte la base de datos procesada en formato ".csv"

In [ ]:
df.to_csv('ecommerce2.csv', index=True)

Exploracion de funciones groupby, sort values, set index, sample, pivot, reset index y merge

In [ ]:
df_ordenado = df.sort_values('MontoTotal', ascending= False)

In [ ]:
df_ordenado

In [ ]:
df_groupby = df.groupby('Country')['Quantity'].mean()

In [108]:
df_groupby

Country
Australia               66.444003
Austria                 12.037406
Bahrain                 13.684211
Belgium                 11.189947
Brazil                  11.125000
Canada                  18.298013
Channel Islands         12.505277
Cyprus                  10.155949
Czech Republic          19.733333
Denmark                 21.048843
EIRE                    17.403245
European Community       8.147541
Finland                 15.346763
France                  12.911067
Germany                 12.369458
Greece                  10.657534
Hong Kong               16.559028
Iceland                 13.505495
Israel                  14.656566
Italy                    9.961395
Japan                   70.441341
Lebanon                  8.577778
Lithuania               18.628571
Malta                    7.433071
Netherlands             84.406580
Norway                  17.722836
Poland                  10.712610
Portugal                10.651745
RSA                      6.068966
Saudi Arabia             7.500000
Singapore               22.855895
Spain                   10.589814
Sweden                  77.136364
Switzerland             15.147353
USA                      3.553265
United Arab Emirates    14.441176
United Kingdom           8.605486
Unspecified              7.399103
Name: Quantity, dtype: float64

### 2.3 Estadisticas descriptivas

In [1]:
import pandas as pd 
import numpy as np

Crear un diccionario con 50 datos que contenga al menos tres atributos continuos

In [ ]:
np.random.seed(42)
Edad = np.random.randint(18, 95, size=50)
Nota = np.random.randint(1.0, 7.0, size=50)

dict = {
   'Edad':Edad,
    'Nota': Nota
     }

Transforme dicho diccionario a un dataFrame de Pandas

In [ ]:
df = pd.DataFrame(dict)
df.head()
df

Estadisticas descriptivas de tendencia central

In [32]:
df.describe()

            Edad       Nota
count  50.000000  50.000000
mean   57.720000   3.520000
std    23.985574   1.775571
min    19.000000   1.000000
25%    38.000000   2.000000
50%    65.000000   4.000000
75%    77.000000   5.000000
max    93.000000   6.000000

Estadisticas descriptivas de dispersion

In [36]:
print('rango nota: ', np.round(df.Nota.max()-df.Nota.min(),2))
print('rango edad: ', np.round(df.Edad.max()-df.Edad.min(),2))

rango nota:  5
rango edad:  74

In [37]:
print('desviación estándar nota: ', np.round(df.Nota.std(),2))
print('desviación estándar edad: ', np.round(df.Edad.std(),2))

desviación estándar nota:  1.78
desviación estándar edad:  23.99

In [38]:
print('Varianza nota: ', np.round(df.Nota.var(),2))
print('Varianza edad: ', np.round(df.Edad.var(),2))

Varianza nota:  3.15
Varianza edad:  575.31

In [39]:
df[['Edad', 'Nota']].quantile([0.25,0.5,0.75])

      Edad  Nota
0.25  38.0   2.0
0.50  65.0   4.0
0.75  77.0   5.0

### 2.4 Transformacion e imputacion de datos

In [3]:
import pandas as pd 
import numpy as np
from sklearn.impute import SimpleImputer

Cargar las bases de datos de nombre "ratings data.csv" y "books data.csv"

In [67]:
df1 = pd.read_csv('ratings_data.csv', encoding= 'utf-8')
df2 = pd.read_csv('books_data.csv', sep = ';', encoding= 'ISO-8859-1')

In [82]:
df1.head()

   Unnamed: 0  User-ID        ISBN  Book-Rating  MeanRating
0           0   276725  034545104X            0    2.933333
1           1   276726  0155061224            5    2.500000
2           2   276727  0446520802            0    4.060345
3           3   276729  052165615X            3    3.000000
4           4   276729  0521795028            6    6.000000

In [83]:
df2.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton & Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [70]:
df1.columns = df1.columns.str.strip()
df2.columns = df2.columns.str.strip()

Utilizando "ratings data.csv" genere un diagnostico de numeros perdidos

In [7]:
df1.replace(0, np.nan, inplace=True)

In [14]:
df1.isnull().sum()

Unnamed: 0     1
User-ID        0
ISBN           0
Book-Rating    0
MeanRating     0
dtype: int64

In [15]:
df1.notnull().sum()

Unnamed: 0     1149779
User-ID        1149780
ISBN           1149780
Book-Rating    1149780
MeanRating     1149780
dtype: int64

In [10]:
imputer = SimpleImputer(strategy='mean')

In [11]:
df1[['Book-Rating', 'MeanRating']] = imputer.fit_transform(df1[['Book-Rating', 'MeanRating']])

In [12]:
df1

         Unnamed: 0  User-ID         ISBN  Book-Rating  MeanRating
0               NaN   276725   034545104X     7.601066    2.933333
1               1.0   276726   0155061224     5.000000    2.500000
2               2.0   276727   0446520802     7.601066    4.060345
3               3.0   276729   052165615X     3.000000    3.000000
4               4.0   276729   0521795028     6.000000    6.000000
...             ...      ...          ...          ...         ...
1149775   1149775.0   276704   1563526298     9.000000    7.000000
1149776   1149776.0   276706   0679447156     7.601066    2.925000
1149777   1149777.0   276709   0515107662    10.000000    3.454545
1149778   1149778.0   276721   0590442449    10.000000    1.200000
1149779   1149779.0   276723  05162443314     8.000000    8.000000

[1149780 rows x 5 columns]

In [13]:
df1.isnull().sum()

Unnamed: 0     1
User-ID        0
ISBN           0
Book-Rating    0
MeanRating     0
dtype: int64

En "ratings data.csv genere una nueva variable que represente el promedio de rating para cada
ISBN distinto

In [26]:
df1['Promedio_Rating'] =  df1.groupby('ISBN')['MeanRating'].transform('mean')

In [20]:
df1

,Unnamed: 0,User-ID,ISBN,Book-Rating,MeanRating,Promedio_Rating
0,NaN,276725,034545104X,7.601066,2.933333,NaN
1,1.0,276726,0155061224,5.000000,2.500000,NaN
2,2.0,276727,0446520802,7.601066,4.060345,NaN
3,3.0,276729,052165615X,3.000000,3.000000,NaN
4,4.0,276729,0521795028,6.000000,6.000000,NaN
...,...,...,...,...,...,...
1149775,1149775.0,276704,1563526298,9.000000,7.000000,NaN
1149776,1149776.0,276706,0679447156,7.601066,2.925000,NaN
1149777,1149777.0,276709,0515107662,10.000000,3.454545,NaN
1149778,1149778.0,276721,0590442449,10.000000,1.200000,NaN
1149779,1149779.0,276723,05162443314,8.000000,8.000000,NaN

Utilizando la columna ISBN de cada base de datos consolidelas en una sola base de datos con todos los atributos de "books data.csv"

In [71]:
print(df1['ISBN'].isnull().sum()) 
print(df2['ISBN'].isnull().sum())

0
0

In [72]:
df_atributos_unidos = pd.merge(df1,df2, on='ISBN')

Exporte la base de datos consolidada

In [73]:
df_atributos_unidos.to_csv('Book_yRating.csv', index=True)

In [81]:
df3= pd.read_csv('Book_yRating.csv')
df3.head()

,Unnamed: 0.1,Unnamed: 0,User-ID,ISBN,Book-Rating,MeanRating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0,0,276725,034545104X,0,2.933333,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...
1,1,1,276726,0155061224,5,2.500000,Rites of Passage,Judith Rae,2001,Heinle,http://images.amazon.com/images/P/0155061224.0...,http://images.amazon.com/images/P/0155061224.0...,http://images.amazon.com/images/P/0155061224.0...
2,2,2,276727,0446520802,0,4.060345,The Notebook,Nicholas Sparks,1996,Warner Books,http://images.amazon.com/images/P/0446520802.0...,http://images.amazon.com/images/P/0446520802.0...,http://images.amazon.com/images/P/0446520802.0...
3,3,3,276729,052165615X,3,3.000000,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,http://images.amazon.com/images/P/052165615X.0...,http://images.amazon.com/images/P/052165615X.0...,http://images.amazon.com/images/P/052165615X.0...
4,4,4,276729,0521795028,6,6.000000,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001,Cambridge University Press,http://images.amazon.com/images/P/0521795028.0...,http://images.amazon.com/images/P/0521795028.0...,http://images.amazon.com/images/P/0521795028.0...